[
    {
        "id": 1,
        "order": 1,
        "phase": "premortal",
        "phaseLabel": "Premortal Life",
        "title": "Spirit Children of Heavenly Parents",
        "summary": "Before this life, we lived as spirit sons and daughters of Heavenly Parents, learning, progressing, and forming eternal relationships.",
        "scriptureRef": "Jeremiah 1:5",
        "scriptureText": "\"Before I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee...\"",
        "insight": "Your existence began long before your birth. You were known, valued, and prepared for a unique purpose in God’s family. Your identity is rooted in eternity, not circumstance."
    },
    {
        "id": 2,
        "order": 2,
        "phase": "premortal",
        "phaseLabel": "Premortal Life",
        "title": "The Council in Heaven",
        "summary": "Heavenly Father presented His Plan of Happiness, choosing Jesus Christ as the Savior who would make our progression possible.",
        "scriptureRef": "Abraham 3:24–25",
        "scriptureText": "\"We will go down, for there is space there, and we will take of these materials... and we will prove them herewith.\"",
        "insight": "Your life is not accidental—it's the result of a divine, thoughtful council. You agreed to come to earth knowing Christ would guide and redeem you. Your journey has purpose and eternal direction."
    },
    {
        "id": 3,
        "order": 3,
        "phase": "premortal",
        "phaseLabel": "Premortal Life",
        "title": "Agency and Choice",
        "summary": "In the premortal world, we chose to follow Heavenly Father and Jesus Christ, accepting a plan that required agency, risk, and growth.",
        "scriptureRef": "Moses 4:3",
        "scriptureText": "\"Satan sought to destroy the agency of man...\"",
        "insight": "Agency is not just freedom—it is the foundation of your eternal growth. Every choice shapes who you become. Choosing Christ is the choice that brings lasting peace and progress."
    },
    {
        "id": 4,
        "order": 4,
        "phase": "mortal",
        "phaseLabel": "Earth Life",
        "title": "Birth and a Physical Body",
        "summary": "Receiving a physical body begins our mortal experience—a time designed for growth, testing, joy, and learning things we could not learn in the spirit alone.",
        "scriptureRef": "Alma 34:32",
        "scriptureText": "\"This life is the time for men to prepare to meet God...\"",
        "insight": "Mortality is a sacred classroom. Even its difficulties are tailored to transform you. Every challenge can become a step toward becoming more like the Savior."
    },
    {
        "id": 5,
        "order": 5,
        "phase": "mortal",
        "phaseLabel": "Earth Life",
        "title": "Faith and Repentance",
        "summary": "Faith in Jesus Christ leads us to change, grow, and realign our lives with God through sincere repentance.",
        "scriptureRef": "Articles of Faith 1:3",
        "scriptureText": "\"We believe that through the Atonement of Christ, all mankind may be saved, by obedience to the laws and ordinances of the Gospel.\"",
        "insight": "Repentance is not a punishment—it is a gift. It is a daily invitation to return to Christ, refine your heart, and experience real spiritual renewal."
    },
    {
        "id": 6,
        "order": 6,
        "phase": "mortal",
        "phaseLabel": "Earth Life",
        "title": "Covenants and Ordinances",
        "summary": "Through ordinances like baptism and confirmation, we enter into sacred, binding covenants that draw us closer to Jesus Christ and strengthen us with His power.",
        "scriptureRef": "3 Nephi 11:33–34",
        "scriptureText": "\"He that believeth in me, and is baptized, the same shall be saved...\"",
        "insight": "Covenants are not restrictions—they are spiritual partnerships with God. They unlock divine help, protection, and direction throughout your life."
    },
    {
        "id": 7,
        "order": 7,
        "phase": "mortal",
        "phaseLabel": "Earth Life",
        "title": "The Atonement of Jesus Christ",
        "summary": "Through His infinite Atonement, Jesus Christ bore our sins, pains, sorrows, and weaknesses, making redemption and healing possible.",
        "scriptureRef": "Alma 7:11–13",
        "scriptureText": "\"He will take upon him the pains and the sicknesses of his people...\"",
        "insight": "Christ not only understands your struggles—He has personally experienced them. His Atonement transforms suffering into strength, guilt into peace, and mortality into hope."
    },
    {
        "id": 8,
        "order": 8,
        "phase": "spirit-world",
        "phaseLabel": "Spirit World",
        "title": "Life After Death",
        "summary": "After death, our spirits move to the spirit world—a place of continued learning, peace, and preparation for resurrection.",
        "scriptureRef": "Alma 40:11–12",
        "scriptureText": "\"The spirits of all men... are taken home to that God who gave them life.\"",
        "insight": "Death is not a disappearance—it is a return. You continue to learn, grow, and progress, surrounded by God’s love and the influence of the Savior."
    },
    {
        "id": 9,
        "order": 9,
        "phase": "spirit-world",
        "phaseLabel": "Spirit World",
        "title": "Preaching the Gospel in the Spirit World",
        "summary": "Those who did not receive the gospel in mortality are taught in the spirit world, ensuring that all of God’s children receive a fair and loving opportunity.",
        "scriptureRef": "1 Peter 4:6",
        "scriptureText": "\"For for this cause was the gospel preached also to them that are dead...\"",
        "insight": "God’s mercy is perfectly inclusive. No one is forgotten, overlooked, or denied the truth because of where or when they lived."
    },
    {
        "id": 10,
        "order": 10,
        "phase": "spirit-world",
        "phaseLabel": "Spirit World",
        "title": "Spirit Paradise and Spirit Prison",
        "summary": "The spirit world includes conditions of peace or learning based on our choices. Through Christ, progression continues beyond the veil.",
        "scriptureRef": "Doctrine and Covenants 138",
        "scriptureText": "\"He organized his forces and appointed messengers...\"",
        "insight": "Christ’s ministry does not stop at death. His love penetrates every place—bringing hope, teaching, and redemption to all willing souls."
    },
    {
        "id": 11,
        "order": 11,
        "phase": "resurrection",
        "phaseLabel": "Resurrection & Judgment",
        "title": "Resurrection",
        "summary": "Because of Christ’s victory over death, every person will rise with a perfected, immortal body.",
        "scriptureRef": "1 Corinthians 15:22",
        "scriptureText": "\"For as in Adam all die, even so in Christ shall all be made alive.\"",
        "insight": "Resurrection is a gift of pure grace—restoring what was lost, healing what was broken, and ensuring that death never has the final word."
    },
    {
        "id": 12,
        "order": 12,
        "phase": "resurrection",
        "phaseLabel": "Resurrection & Judgment",
        "title": "Final Judgment",
        "summary": "We will stand before Jesus Christ, who will judge us with perfect justice, mercy, and complete understanding of our lives and desires.",
        "scriptureRef": "Alma 12:14",
        "scriptureText": "\"Our words will condemn us, yea, all our works will condemn us...\"",
        "insight": "The judgment is not meant to shame—it is a moment of truth, healing, and clarity. Christ sees your intentions, your efforts, and your heart."
    },
    {
        "id": 13,
        "order": 13,
        "phase": "kingdoms",
        "phaseLabel": "Kingdoms of Glory",
        "title": "Celestial Kingdom",
        "summary": "The highest degree of glory is reserved for those who embrace Christ fully, keep their covenants, and endure faithfully to the end.",
        "scriptureRef": "Doctrine and Covenants 76:50–53",
        "scriptureText": "\"They are they who received the testimony of Jesus...\"",
        "insight": "The celestial kingdom is not simply a destination—it is the fulfillment of divine love: eternal families, limitless growth, and the presence of God forever."
    },
    {
        "id": 14,
        "order": 14,
        "phase": "kingdoms",
        "phaseLabel": "Kingdoms of Glory",
        "title": "Terrestrial Kingdom",
        "summary": "Those who lived honorable lives but did not fully accept the gospel in mortality receive terrestrial glory through God’s justice and mercy.",
        "scriptureRef": "Doctrine and Covenants 76:71–79",
        "scriptureText": "\"These are they who are honorable men of the earth...\"",
        "insight": "The terrestrial kingdom reveals God’s respect for agency. He honors sincerity, goodness, and righteousness—even when faith was incomplete."
    },
    {
        "id": 15,
        "order": 15,
        "phase": "kingdoms",
        "phaseLabel": "Kingdoms of Glory",
        "title": "Telestial Kingdom",
        "summary": "Those who repeatedly rejected the gospel in mortality but eventually accept Christ’s justice and mercy inherit telestial glory.",
        "scriptureRef": "Doctrine and Covenants 76:81–89",
        "scriptureText": "\"These are they who are liars, and sorcerers...\"",
        "insight": "Even the telestial kingdom shines with God’s goodness. It testifies that His mercy extends further than we can imagine—lifting every soul to a glory they are willing to receive."
    }
]